In [1]:
# Create a Custom Dataframe
import pandas as pd

player_list = [['M.S.Dhoni', 36, 75, 5428000],
               ['A.B.D Villers', 38, 74, 3428000],
               ['V.Kohli', 31, 70, 8428000],
               ['S.Smith', 34, 80, 4428000],
               ['C.Gayle', 40, 100, 4528000],
               ['J.Root', 33, 72, 7028000],
               ['K.Peterson', 42, 85, 2528000]]

df = pd.DataFrame(player_list, columns=['Name', 'Age', 'Weight', 'Salary'])
print(df)

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000
6     K.Peterson   42      85  2528000

In [5]:
# Slicing Using iloc[] (Integer-Based Indexing)
df.iloc[0:3]

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000

In [9]:
# Slicing Columns in dataframe
df.iloc[:,0:1]

            Name
0      M.S.Dhoni
1  A.B.D Villers
2        V.Kohli
3        S.Smith
4        C.Gayle
5         J.Root
6     K.Peterson

In [14]:
# electing a Specific Cell in a Pandas DataFrame
# row ko 1 ani column chai 2 which is weight
df.iloc[1,2]

74

In [19]:
# Using Boolean Conditions in a Pandas DataFrame
df[df["Age"] >35].iloc[:]

            Name  Age  Weight   Salary
0      M.S.Dhoni   36      75  5428000
1  A.B.D Villers   38      74  3428000
4        C.Gayle   40     100  4528000
6     K.Peterson   42      85  2528000

In [20]:
# Slicing Using loc[]
# Slicing Rows in Dataframe
df.loc[3]

Name      S.Smith
Age            34
Weight         80
Salary    4428000
Name: 3, dtype: object

In [24]:
df.set_index("Name", inplace= True)
df.loc['A.B.D Villers':'K.Peterson']

               Age  Weight   Salary
Name
A.B.D Villers   38      74  3428000
V.Kohli         31      70  8428000
S.Smith         34      80  4428000
C.Gayle         40     100  4528000
J.Root          33      72  7028000
K.Peterson      42      85  2528000

In [28]:
# Selecting Specified cell in Dataframe
df.loc['A.B.D Villers', 'Salary']

3428000